<?php

$memberShop['company_client'] = [
    '新增店铺' => [
        '发货模式' => ['直发', '代发']
    ],
    '商品管理' => [
        '管理' => '普通商品',
    ],
    '订单管理' => [
        '查看' => ['普通订单'],
        '操作' => []
    ],
    '店铺设置' => [
        '订单设置' => ['自动取消时间', '自动收货时间'],
        '商品设置' => ['自建商品开关'],
        '支付方式' => [
            '支付模式' => ['微信原生支付', '中金微信支付', '融合支付'],
            '设置项' => ['在线支付开关']
        ],
    ]
];

$memberShop['store_client'] = [
    '商品管理' => ['分类管理', '自建商品', '导入商品'],
    '订单管理' => [
        '查看' => ['店铺订单', '代发订单'],
        '操作' => [
            '店铺订单' => ['接单', '取消订单', '发货', '发货通知', '完成'],
            '代发订单' => ['接单', '取消订单', '发货', '发货通知', '完成'],
        ]
    ],
    '店铺设置' => [
        '店铺信息',
        '订单设置',
        '支付设置' => ['货到付款', '原生/中金微信支付'],
        '配送设置' => ['上门自提', '同城配送', '普通快递'],
        '打印设置'
    ],
    '资金管理' => [
        '原生微信支付' => ['营业流水'],
        '中金微信支付' => ['营业流水', '低级提现'],
        '融合支付' => ['营业流水', '高级提现'],
    ],
    '会员管理',
    '优惠券核销',
    '数据统计',
    '营销' => ['精选推荐', '店铺推荐', '代金券', '会员卡', '社群团购']
];

$memberShop['member_client'] = [
    '商品购买' => ['普通商品'],
    '支付方式' => ['微信原生支付', '中金微信支付', '融合支付', '货到付款'],
    '配送方式' => ['上门自提', '同城配送', '普通快递'],
    '订单操作' => [
        '普通订单' => ['下单', '支付', '取消', '确认收货']
    ]
];


$distributionShop['company_client'] = [
    '新增店铺' => [
        '发货模式' => ['总发']
    ],
    '商品管理' => [
        '管理' => '分销商品',
        '设置' => '佣金设置',
    ],
    '订单管理' => [
        '查看' => ['分销订单'],
        '操作' => ['取消', '接单', '发货', '发货通知']
    ],
    '店铺设置' => [
        '订单设置' => ['自动取消时间', '自动收货时间'],
        '商品设置' => ['佣金设置'],
        '配送设置' => ['普通快递'],
        '支付方式' => [
            '支付模式' => ['融合支付'],
            '设置项' => ['在线支付开关']
        ],
    ]
];

$distributionShop['store_client'] = [
    '商品管理' => ['分类管理', '导入商品'],
    '订单管理' => [
        '查看' => ['分销订单'],
        '操作' => [
            '分销订单' => [],
        ]
    ],
    '店铺设置' => [
        '店铺信息',
        '订单设置',
        '支付设置' => [],
        '配送设置' => ['普通快递'],
        '打印设置'
    ],
    '资金管理' => [
        '融合支付' => ['营业流水', '高级提现'],
    ],
    '会员管理',
    '数据统计',
    '营销' => ['精选推荐', '店铺推荐', '代金券', '会员卡']
];

$distributionShop['member_client'] = [
    '商品购买' => ['分销商品'],
    '支付方式' => ['融合支付'],
    '配送方式' => ['普通快递'],
    '订单操作' => [
        '分销订单' => ['下单', '支付', '取消', '确认收货']
    ]
];

$groupShop['company_client'] = [
    '新增店铺' => [
        '发货模式' => ['总发']
    ],
    '商品管理' => [
        '管理' => '团购商品',
        '设置' => '分润设置',
    ],
    '订单管理' => [
        '查看' => ['团购订单'],
        '操作' => ['取消', '总部接单', '总部发货']
    ],
    '店铺设置' => [
        '订单设置' => ['自动取消时间', '自动收货时间'],
        '商品设置' => ['佣金设置'],
        '配送设置' => ['普通快递'],
        '支付方式' => [
            '支付模式' => ['中金支付',  '融合支付'],
            '设置项' => ['在线支付开关']
        ],
    ]
];

$distributionShop['store_client'] = [
    '商品管理' => ['分类管理', '导入商品'],
    '订单管理' => [
        '查看' => ['团购订单'],
        '操作' => [
            '分销订单' => ['取消', '接单', '发货', '完成'],
        ]
    ],
    '店铺设置' => [
        '店铺信息',
        '订单设置',
        '支付设置' => [],
        '配送设置' => ['普通快递', '到店自提'],
        '打印设置'
    ],
    '资金管理' => [
        '融合支付' => ['营业流水', '高级提现'],
        '中金支付' => ['营业流水', '低级提现'],
    ],
    '会员管理',
    '数据统计',
    '营销' => ['精选推荐', '店铺推荐', '代金券', '会员卡']
];

$distributionShop['member_client'] = [
    '商品购买' => ['分销商品'],
    '支付方式' => ['融合支付'],
    '配送方式' => ['普通快递'],
    '订单操作' => [
        '团购订单' => ['下单', '支付', '取消', '确认收货']
    ]
];


/**
 * 做图步骤
 * 1, 画出基础部分
 * 2. 画出差异化图片
 * 3. 颜色标注
 */